name: "dynamic_batching"
backend: "python"
max_batch_size: 32

input [
  {
    name: "images"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  },
  {
    name: "boxes"
    data_type: TYPE_FP32
    dims: [ -1, 4 ]
  }
]

output [
  {
    name: "boxes"
    data_type: TYPE_FP32
    dims: [ -1, 4 ]
  },
  {
    name: "scores"
    data_type: TYPE_FP32
    dims: [ -1 ]
  },
  {
    name: "labels"
    data_type: TYPE_INT64
    dims: [ -1 ]
  },
  {
    name: "batch_index"
    data_type: TYPE_INT64
    dims: [ -1 ]
  }
]

dynamic_batching {
  preferred_batch_size: [ 1, 2, 4, 8, 16 ]
  max_queue_delay_microseconds: 1000000
}

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]
